---
kind: method
id: M:Autodesk.Revit.DB.ViewDisplayDepthCueing.Dispose
source: html/aac6a985-6d34-45db-0b1e-6a01140306c7.htm
---
# Autodesk.Revit.DB.ViewDisplayDepthCueing.Dispose Method

Releases all resources used by the ViewDisplayDepthCueing

## Syntax (C#)
```csharp
public void Dispose()
```